Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures.FabricAreaOutSideOfHost
Fabric Area is sketched completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures.FabricAreaLapSplicesIncorrect
Fabric Area lap splice is incorrect.

Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures
Failures related to fabric area elements.